src/Documents/ИС_WB_ФормированиеПоставкиПоFbo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_WB_ФормированиеПоставкиПоFbo</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктивныйШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоНоменклатуры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркированныйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодКоробки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_WB_ШтрихкодыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ШтрихкодыРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры25</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ИС_WB_РазмерыНоменклатур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_WB_РазмерыНоменклатур</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_WB_Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>techSize</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>wbSize</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_WB_ФормированиеПоставкиПоFbo/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиКомандФорм
//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286
&НаКлиенте
Процедура СформироватьФайлПервыйЭтап(Команда)
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументПервыйЭтап(Массив); 
	
	Табличныйдокумент.Показать();
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286
&НаКлиенте
Процедура СформироватьФайлВторойЭтап(Команда) 
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументВторойЭтап(Массив); 
	
	Если Табличныйдокумент <> Неопределено Тогда
		Табличныйдокумент.Показать(); 
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286
&НаКлиенте
Процедура ПечатьЭтикеток(Команда) 
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументЭтикетки(Массив); 
	
	Табличныйдокумент.Показать();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286 

//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286
&НаКлиенте
Процедура ПечатьШтрихкодов(Команда)  
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументШкКоробки(Массив); 
	
	Табличныйдокумент.Показать();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	ОчиститьСообщения(); 
	
	//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163	
	Элементы.НоменклатураКСозданию.Видимость = Ложь;
	//- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета комиссионера";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлу");
	ДополнительныеПараметры.Вставить("Адрес", "АдресОтчетаВоВременномХранилище");  
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));

КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаКлиенте
Процедура ВыполнитьПроверкуАкта(Команда)  
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДокументПередачиТоваровНаКомиссиию) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран документ передачи товаров на комиссию.", , , "ДокументПередачиТоваровНаКомиссиию");
		Возврат;
	КонецЕсли;
	
	УстановитьНачальноеОформление();
		
	ВыполнитьПроверкуАктаНаСервере(); 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
&НаКлиенте
Процедура СоздатьДокументОтгрузки(Команда)   
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли; 
	
	ОшибкаСопоставления = Ложь;
	
	Если Не Элементы.НоменклатураКСозданию.Видимость Тогда
		ЗаполнитьТаблицуДаннымиДокумента();
	КонецЕсли;
	
	Для Каждого Строка Из НоменклатураКСозданию Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;
	
	Если ОшибкаСопоставления Тогда
		Элементы.НоменклатураКСозданию.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Проверьте сопоставление для создания документов!");
		Возврат;
	КонецЕсли;
	
	Комиссия25 = ИспользуетсяСхемаКомиссии25();
	
	Если Комиссия25 Тогда
		ФормаНовогоДокумента = ПолучитьФорму("Документ.ПередачаТоваровХранителю.Форма.ФормаДокумента");	
	Иначе	
		ФормаНовогоДокумента = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");
	КонецЕсли; 
	
	ДанныеФормы = ФормаНовогоДокумента.Объект;
	
	ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25);
	
	КопироватьДанныеФормы(ДанныеФормы, ФормаНовогоДокумента.Объект);

    ФормаНовогоДокумента.Модифицированность = Истина;
	
    ФормаНовогоДокумента.Открыть();  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286  
&НаСервере
Функция СформироватьТабличныйДокументПервыйЭтап(Массив) 
	
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	
	ТаблицаВыгрузки.Колонки.Добавить("баркод", Новый ОписаниеТипов("Строка"));
	ТаблицаВыгрузки.Колонки.Добавить("количество", Новый ОписаниеТипов("Число"));	
	
	Для Каждого Документ Из Массив Цикл
		Для Каждого Строка Из Документ.Товары Цикл
			СтрокаТЗ = ТаблицаВыгрузки.Добавить();
			СтрокаТЗ.баркод = Строка.Штрихкод;
			СтрокаТЗ.количество = Строка.Количество;
		КонецЦикла;
	КонецЦикла;	
	
	ТаблицаВыгрузки.Свернуть("баркод", "количество");
	
	ТабДок = СформироватьТабличныйДокумент(ТаблицаВыгрузки);
	
	Возврат ТабДок
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #56286 
&НаСервере
Функция СформироватьТабличныйДокументВторойЭтап(Массив)
	
	//+ ИнфоСофт Стояк Ю.К. 14.12.2023 УА #66078
	Табдок = Новый ТабличныйДокумент;
	
	МакетОбработки = Документы.ИС_WB_ФормированиеПоставкиПоFbo.ПолучитьМакет("ВторойЭтапПоставки");
	Табдок.ИмяПараметровПечати = "ВторойЭтапПоставки";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");	
	Табдок.Вывести(ОбластьШапка);
	
	//ТаблицаВыгрузки = Новый ТаблицаЗначений;	
	//ТаблицаВыгрузки.Колонки.Добавить("баркод_товара", Новый ОписаниеТипов("Строка"));
	//ТаблицаВыгрузки.Колонки.Добавить("кол-во_товаров", Новый ОписаниеТипов("Число")); 
	//ТаблицаВыгрузки.Колонки.Добавить("шк_короба", Новый ОписаниеТипов("Строка"));
	//ТаблицаВыгрузки.Колонки.Добавить("товар_с_кизом", Новый ОписаниеТипов("Строка")); 
	//ТаблицаВыгрузки.Колонки.Добавить("срок_годности", Новый ОписаниеТипов("Строка"));
	
	ОбластьСтроки = МакетОбработки.ПолучитьОбласть("СтрокаПоставки");
	
	Для Каждого Документ Из Массив Цикл
		Для Каждого Строка Из Документ.Товары Цикл  
			
			ОбластьСтроки.Параметры.баркод = Строка.Штрихкод;;
			ОбластьСтроки.Параметры.количество        = Строка.Количество;
			ОбластьСтроки.Параметры.коробка     = Строка.ШтрихкодКоробки;
			ОбластьСтроки.Параметры.срок    = "";
			Табдок.Вывести(ОбластьСтроки);
			
			//СтрокаТЗ = ТаблицаВыгрузки.Добавить();
			//СтрокаТЗ.баркод = Строка.Штрихкод;
			//СтрокаТЗ.количество = Строка.Количество;
			//СтрокаТЗ.шк_короба = Строка.ШтрихкодКоробки; 
			//СтрокаТЗ.товар_с_кизом = Строка.МаркированныйТовар;
			//СтрокаТЗ.срок_годности = "";
		КонецЦикла;	
	КонецЦикла;                                 
			
	//ТабДок = СформироватьТабличныйДокумент(ТаблицаВыгрузки);
	//- ИнфоСофт Стояк Ю.К. 14.12.2023 УА #66078
	
	Возврат ТабДок
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.05.23 УА #56286	

//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286
&НаСервере
Функция СформироватьТабличныйДокумент(ТаблицаВыгрузки) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Формирование поставки Fbo";
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаВыгрузки); 
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.Вывести(ТабличныйДокумент);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область("R1C1:R1000C1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТабличныйДокумент.Область("R1C1:R1000C1").ШиринаКолонки = 20;
	ТабличныйДокумент.Область("R1C2:R1000C2").ШиринаКолонки = 20;
	
	Возврат ТабличныйДокумент;  
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286
&НаСервере
Функция СформироватьТабличныйДокументЭтикетки(МассивОбъектов)  
		
	Макет = ПолучитьОбщийМакет("ПФ_MXL_ИС_MP_ЭтикеткаТовараFbo");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Зададим параметры макета по-умолчанию
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Этикетки";
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл 
		
		ДокОбъект = ЭлементМассива.Ссылка.ПолучитьОбъект();
		
		ДанныеВбТЗ = ПолучитьДаныеДляФормированияЭтикетки(ЭлементМассива.Ссылка);
		
		// Вывод таблицы
		Для Каждого ЭлементТЗ Из ДанныеВбТЗ Цикл
			
			Для Итератор = 1 По ЭлементТЗ.Количество Цикл
				
				ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("ОсновныеДанные"); 
				
				ОбластьМакетаОсновныеДанные.Параметры.Состав = ЭлементТЗ.Состав;
				
				ОбластьМакетаОсновныеДанные.Параметры.Дата = Формат(ТекущаяДатаСеанса(), "ДЛФ=Д"); 
				
				ОбластьМакетаОсновныеДанные.Параметры.Бренд = ЭлементТЗ.Бренд;
				
				ОбластьМакетаОсновныеДанные.Параметры.Предмет = ЭлементТЗ.Предмет;
				
				ОбластьМакетаОсновныеДанные.Параметры.Цвет = ЭлементТЗ.Цвет;
				
				ОбластьМакетаОсновныеДанные.Параметры.Размер = ЭлементТЗ.Размер; 
				
				ОбластьМакетаОсновныеДанные.Параметры.Артикул = ЭлементТЗ.Артикул;
				
				ПараметрыШтрихкода = ПолучитьСтруктуруФормированияШтрихкода(ЭлементТЗ.Штрихкод);
				
				СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
				Если СтруктураКартинки.Результат Тогда 
					ОбластьМакетаОсновныеДанные.Параметры.ШтрихкодКартинка = СтруктураКартинки.Картинка;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);   
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
								
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 19.05.23 УА #56286
&НаСервере
Функция СформироватьТабличныйДокументШкКоробки(МассивОбъектов) 
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_ИС_MP_ШтрихкодКоробки");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Зададим параметры макета по-умолчанию
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Штрихкоды коробок";
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл 
		
		ДокОбъект = ЭлементМассива.Ссылка.ПолучитьОбъект(); 
		
		ШкКоробокТЗ = ДокОбъект.Товары.Выгрузить();
		
		ШкКоробокТЗ.Свернуть("ШтрихкодКоробки");
		
		// Вывод таблицы
		Для Каждого СтрокаТЧ Из ШкКоробокТЗ Цикл
			
			ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("ОсновныеДанные"); 
			
			ПараметрыШтрихкода = ПолучитьСтруктуруФормированияШтрихкода(СтрокаТЧ.ШтрихкодКоробки);
			
			СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
			
			Если СтруктураКартинки.Результат Тогда 
				ОбластьМакетаОсновныеДанные.Параметры.ШтрихкодКартинка = СтруктураКартинки.Картинка;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);   
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.05.23 УА #56286	

//+ ИнфоСофт Сумин Д.В. 20.05.23 УА #56286
&НаСервере
Функция ПолучитьДаныеДляФормированияЭтикетки(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	&Штрихкоды КАК Штрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Размер, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка)) КАК Размер,
	|	СУММА(ВТ_Штрихкоды.Количество) КАК Количество,
	|	ВТ_Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ПО (ВТ_Штрихкоды.Штрихкод = ИС_WB_ШтрихкодыРазмеров.Штрихкод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|				И ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_ШтрихкодыРазмеров.Размер,
	|	ВТ_Штрихкоды.Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкоды", Документ.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Профиль", Документ.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РезультатТЗ = Новый ТаблицаЗначений;   
	
	РезультатТЗ.Колонки.Добавить("Состав", Новый ОписаниеТипов("Строка"));
	РезультатТЗ.Колонки.Добавить("Бренд", Новый ОписаниеТипов("Строка"));
	РезультатТЗ.Колонки.Добавить("Предмет", Новый ОписаниеТипов("Строка"));
	РезультатТЗ.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Строка"));
    РезультатТЗ.Колонки.Добавить("Размер", Новый ОписаниеТипов("Строка"));
	РезультатТЗ.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"));
	РезультатТЗ.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	РезультатТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтрокаТЗ = РезультатТЗ.Добавить();
		СтрокаТЗ.Количество = ВыборкаДетальныеЗаписи.Количество; 
		СтрокаТЗ.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		СтрокаТЗ.Артикул = ВыборкаДетальныеЗаписи.Размер.Владелец.VendorCode; 
		СтрокаТЗ.Предмет = ВыборкаДетальныеЗаписи.Размер.Владелец.object;
		СтрокаТЗ.Размер = ВыборкаДетальныеЗаписи.Размер.techSize;
		СтрокаТЗ.Состав = ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Состав"); 
		СтрокаТЗ.Бренд = ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Бренд");
        СтрокаТЗ.Цвет = ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Цвет");  
		
	КонецЦикла;  
	
	Возврат РезультатТЗ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 20.05.23 УА #56286	

//+ ИнфоСофт Сумин Д.В. 20.05.23 УА #56286
&НаСервере
Функция ПолучитьЗначенияПолейНоменклатурыВБ(ОбъектДанных, Поле)
	
	Значение = ""; 
	
	Итератор = 0;
	
	Для Каждого Элемент Из ОбъектДанных.Характеристики Цикл 
		
		Если СокрЛП(Элемент.Поле) = Поле Тогда
			
			Если Итератор = 0 Тогда
				Значение = Элемент.Значение;
				Итератор = Итератор + 1;
			Иначе
				Значение = Значение + ", " + Элемент.Значение; 
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Значение;

КонецФункции //- ИнфоСофт Сумин Д.В. 20.05.23 УА #56286	

//+ ИнфоСофт Сумин Д.В. 20.05.23 УА #56286
Функция ПолучитьСтруктуруФормированияШтрихкода(Штрихкод)
		
	СтруктураШтрихкода = Новый Структура;
	
	СтруктураШтрихкода.Вставить("Ширина", 280);
	СтруктураШтрихкода.Вставить("Высота", 100);
	СтруктураШтрихкода.Вставить("ТипКода", 2);
	СтруктураШтрихкода.Вставить("ОтображатьТекст", Истина);
	СтруктураШтрихкода.Вставить("Штрихкод", Штрихкод);
	
	Возврат СтруктураШтрихкода;

КонецФункции //- ИнфоСофт Сумин Д.В. 20.05.23 УА #56286

#КонецОбласти  

#Область ПроверкаАктаПриемки

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЭтотОбъект[ДополнительныеПараметры.Реквизит] = ВыбранныеФайлы[0];
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
		ПутьКФайлуВоВременномКаталоге = ВыбранныеФайлы[0];
		ПоместитьФайлНаСервер(ДополнительныеПараметры.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961  

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаКлиенте
Процедура ПоместитьФайлНаСервер(Адрес)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект, Новый Структура("Адрес", Адрес));
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуВоВременномКаталоге, УникальныйИдентификатор);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961 

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось поместить файл на сервер, попробуйте ещё раз...", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[Параметры.Адрес] = Результат.Адрес;          
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаКлиенте
Процедура УстановитьНачальноеОформление()
	ОчиститьСообщения();
	Избыток.Очистить();
	Недостача.Очистить();
	НеНайденныеШтрихкоды.Очистить();
	Элементы.ГруппаИзбыток.Скрыть();
	Элементы.ГруппаНедостача.Скрыть();
	Элементы.ГруппаНеНайденныеШтрихкоды.Скрыть();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаСервере
Процедура ВыполнитьПроверкуАктаНаСервере()

	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);  
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	ДанныеАкта = Новый ТаблицаЗначений;
	ДанныеАкта.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеАкта.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	
	Для сч = 13 По КоличествоСтрок Цикл 	
		Попытка
			Баркод  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 4).ТекущаяОбласть.Текст);
			
			Если Баркод = "" Тогда
				Прервать;
			КонецЕсли;
			
			//+ ИнфоСофт Сумин Д.В. 26.10.2023 УА #65006
			Количество  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 9).ТекущаяОбласть.Текст);
			//Количество  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 8).ТекущаяОбласть.Текст); 
			//- ИнфоСофт Сумин Д.В. 26.10.2023 УА #65006 
			
			НоваяСтрока 			= ДанныеАкта.Добавить();
			НоваяСтрока.Баркод 		= Баркод;
			НоваяСтрока.Количество 	= Количество;
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось загрузить строку " + Строка(сч)); 	
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
	КонецПопытки;
	
	Если ДанныеАкта.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран некорректный файл. Выберите акт приемкм товаров.");
		Возврат;
	КонецЕсли;
	
	ДанныеАктаНоменклатура = ПолучитьСоответствияНоменклатуры(ДанныеАкта);
	
	ВыполнитьПроверкуНаНеизвестныеШтрихкоды(ДанныеАкта);
	
	ДанныеДокумента = ПолучитьДанныеДокумента();
	
	Если ДанныеДокумента.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Товары не найдены в документе. Проверьте выбранный документ.");
		Возврат;
	КонецЕсли;
	
	ВыполнитьСравнениеДанных(ДанныеАктаНоменклатура, ДанныеДокумента);
	
	Если Избыток.Количество() = 0 И Избыток.Количество() = 0 И НеНайденныеШтрихкоды.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Расхождений не найдено.");
		Возврат;
	КонецЕсли;
	
	Если Избыток.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Найдены товары отсутствующие в документе передачи.");
		Элементы.ГруппаИзбыток.Показать();
	КонецЕсли;
	
	Если Недостача.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Найдены товары отсутствующие в акте.");
		Элементы.ГруппаНедостача.Показать();
	КонецЕсли;
	
	Если НеНайденныеШтрихкоды.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Найдены не идентифицированные штрихкоды.");
		Элементы.ГруппаНеНайденныеШтрихкоды.Показать();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961
&НаСервере
Функция ПолучитьСоответствияНоменклатуры(ДанныеАкта) 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДанныеАкта.Баркод КАК Баркод,
	|	ДанныеАкта.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ДанныеАкта
	|ИЗ
	|	&ДанныеАкта КАК ДанныеАкта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеАкта.Баркод КАК Баркод,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Характеристика) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_ДанныеАкта КАК ВТ_ДанныеАкта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|			ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|		ПО ВТ_ДанныеАкта.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
	|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеАкта.Баркод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Баркод КАК Баркод,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Набор
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Номенклатура.ЭтоНабор = ИСТИНА
	|			ТОГДА ВТ_Набор.Номенклатура
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Номенклатура.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_Номенклатура.ЭтоНабор = ИСТИНА
	|			ТОГДА ВТ_Набор.Характеристика
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Номенклатура.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_Номенклатура.ЭтоНабор = ИСТИНА
	|			ТОГДА ВТ_ДанныеАкта.Количество * ВТ_Набор.Количество
	|		ИНАЧЕ ВТ_ДанныеАкта.Количество
	|	КОНЕЦ КАК Количество,
	|	ВТ_ДанныеАкта.Баркод КАК Баркод
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_ДанныеАкта КАК ВТ_ДанныеАкта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО (ВТ_ДанныеАкта.Баркод = ВТ_Номенклатура.Баркод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Набор КАК ВТ_Набор
	|		ПО (ВТ_ДанныеАкта.Баркод = ВТ_Набор.Баркод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.Характеристика КАК Характеристика,
	|	СУММА(ВТ_Результат.Количество) КАК Количество,
	|	ВТ_Результат.Баркод КАК Баркод
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.Номенклатура,
	|	ВТ_Результат.Характеристика,
	|	ВТ_Результат.Баркод");
	
	Запрос.УстановитьПараметр("ДанныеАкта", ДанныеАкта); 
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеНоменклатура = Новый ТаблицаЗначений;
	ДанныеНоменклатура.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеНоменклатура.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеНоменклатура.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДанныеНоменклатура.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока 				= ДанныеНоменклатура.Добавить();
		НоваяСтрока.Количество 		= Выборка.Количество;
		НоваяСтрока.Номенклатура 	= Выборка.Номенклатура;
		НоваяСтрока.Характеристика 	= Выборка.Характеристика;	
		НоваяСтрока.Баркод		 	= Выборка.Баркод;
	КонецЦикла;	
	
	Возврат ДанныеНоменклатура;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961
&НаСервере
Функция ПолучитьДанныеДокумента() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыТЧ.Номенклатура КАК Номенклатура,
	|	ТоварыТЧ.Характеристика КАК Характеристика,
	|	СУММА(ТоварыТЧ.КоличествоУпаковок) КАК Количество
	|ИЗ
	|	&ИмяДокумента КАК ТоварыТЧ
	|ГДЕ
	|	ТоварыТЧ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыТЧ.Номенклатура,
	|	ТоварыТЧ.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика"); 
	
	Если ТипЗнч(ДокументПередачиТоваровНаКомиссиию) = Тип("ДокументСсылка.ПередачаТоваровХранителю") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяДокумента", "Документ.ПередачаТоваровХранителю.Товары");	
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяДокумента", "Документ.РеализацияТоваровУслуг.Товары");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументПередачиТоваровНаКомиссиию);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеДокумента = Новый ТаблицаЗначений;	
	ДанныеДокумента.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеДокумента.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеДокумента.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока					= ДанныеДокумента.Добавить();
		НоваяСтрока.Количество 		= Выборка.Количество;
		НоваяСтрока.Номенклатура 	= Выборка.Номенклатура;
		НоваяСтрока.Характеристика	= Выборка.Характеристика;
	КонецЦикла;
	
	Возврат ДанныеДокумента;
		
КонецФункции //- ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961
&НаСервере
Процедура ВыполнитьСравнениеДанных(ДанныеАкта, ДанныеДокумента) 

	//Выполним поиск соответсвий данных документа к данным акта 
	ДанныеДокументаОбработка = ДанныеДокумента; 
	
	Для Каждого СтрокаАкта Из ДанныеАкта Цикл
		
		СоответствияНайдены = Ложь;	
		
		Для Каждого СтрокаДокумента Из ДанныеДокументаОбработка Цикл  
			
			Если СтрокаАкта.Номенклатура = СтрокаДокумента.Номенклатура И СтрокаАкта.Характеристика = СтрокаДокумента.Характеристика Тогда
				Разница = СтрокаАкта.Количество - СтрокаДокумента.Количество;	
				//Добавим данные о расхождениях
				//+ ИнфоСофт Сумин Д.В. 26.10.2023 УА #65006
				Если Разница = 0 Тогда 
				ИначеЕсли Разница > 0 Тогда
					ДобавитьСтрокуИзбыток(СтрокаАкта, Разница);	
				Иначе
					ДобавитьСтрокуНедостача(СтрокаАкта, Разница);	
				КонецЕсли;
				//Если Разница > 0 Тогда
				//	ДобавитьСтрокуИзбыток(СтрокаАкта, Разница);	
				//Иначе
				//	ДобавитьСтрокуНедостача(СтрокаАкта, Разница);	
				//КонецЕсли;  
				//- ИнфоСофт Сумин Д.В. 26.10.2023 УА #65006  
				
				ДанныеДокументаОбработка.Удалить(СтрокаДокумента); 
				
				СоответствияНайдены = Истина;
				
			КонецЕсли;  
			
		КонецЦикла;	
		
		Если Не СоответствияНайдены И ЗначениеЗаполнено(СтрокаАкта.Номенклатура) Тогда
			ДобавитьСтрокуИзбыток(СтрокаАкта, СтрокаАкта.Количество);	
		КонецЕсли;
		
	КонецЦикла;
	
	//Выполним поиск соответсвий данных акта к данным документа
	ДанныеАктаОбработка = ДанныеАкта; 
	
	Для Каждого СтрокаДокумента Из ДанныеДокумента Цикл
				 	
		СоответствияНайдены = Ложь;	
		
		Для Каждого СтрокаАкта Из ДанныеАктаОбработка Цикл   	
			Если СтрокаАкта.Номенклатура = СтрокаДокумента.Номенклатура И СтрокаАкта.Характеристика = СтрокаДокумента.Характеристика Тогда
				ДанныеАктаОбработка.Удалить(СтрокаАкта); 
				СоответствияНайдены = Истина;	
			КонецЕсли;			
		КонецЦикла;
		
		Если Не СоответствияНайдены И ЗначениеЗаполнено(СтрокаАкта.Номенклатура) Тогда
			ДобавитьСтрокуНедостача(СтрокаДокумента, СтрокаДокумента.Количество);	
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961
&НаСервере
Процедура ДобавитьСтрокуИзбыток(СтрокаАкта, Количество) 
	
	НоваяСтрока 					= Избыток.Добавить();
	НоваяСтрока.Номенклатура 		= СтрокаАкта.Номенклатура;
	НоваяСтрока.Характеристика 		= СтрокаАкта.Характеристика;
	Если Количество < 0 Тогда
		Количество = -Количество;
	КонецЕсли;	
	НоваяСтрока.Количество 			= Количество;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961 

//+ ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961
&НаСервере
Процедура ДобавитьСтрокуНедостача(СтрокаАкта, Количество) 
	
	НоваяСтрока 					= Недостача.Добавить();
	НоваяСтрока.Номенклатура 		= СтрокаАкта.Номенклатура;
	НоваяСтрока.Характеристика 		= СтрокаАкта.Характеристика;
	Если Количество < 0 Тогда
		Количество = -Количество;
	КонецЕсли;
	НоваяСтрока.Количество 			= Количество;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961
&НаСервере
Процедура ВыполнитьПроверкуНаНеизвестныеШтрихкоды(ДанныеАкта)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|		ДанныеАкта.Баркод КАК Баркод,
	|		ДанныеАкта.Количество КАК Количество
	|	ПОМЕСТИТЬ ВТ_ДанныеАкта
	|	ИЗ
	|		&ДанныеАкта КАК ДанныеАкта
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ВТ_ДанныеАкта.Баркод КАК Баркод,
	|		МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Номенклатура) КАК Номенклатура,
	|		МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Характеристика) КАК Характеристика,
	|		МАКСИМУМ(ВТ_ДанныеАкта.Количество) КАК Количество
	|	ИЗ
	|		ВТ_ДанныеАкта КАК ВТ_ДанныеАкта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|				ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|			ПО ВТ_ДанныеАкта.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
	|				И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ДанныеАкта.Баркод");
	
	Запрос.УстановитьПараметр("ДанныеАкта", ДанныеАкта); 
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеНоменклатура = Новый ТаблицаЗначений;
	ДанныеНоменклатура.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеНоменклатура.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеНоменклатура.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеНоменклатура.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			СтрокаТЗ 			= НеНайденныеШтрихкоды.Добавить();
			СтрокаТЗ.Штрихкод 	= Выборка.Баркод;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.09.2023 УА #61961

//+ ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080 
&НаСервере
Функция ИспользуетсяСхемаКомиссии25()  
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");		
	
	Если ИспользоватьДоговорыСКлиентами Тогда
		Если Не ЗначениеЗаполнено(Профиль.Договор) Тогда
			Возврат Ложь;
		Иначе
			Возврат Профиль.Договор.КомиссионныеПродажи25;	
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Профиль.Соглашение) Тогда
			Возврат Ложь;
		Иначе
			Возврат Профиль.Соглашение.КомиссионныеПродажи25;	
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
&НаСервере
Процедура ЗаполнитьТаблицуДаннымиДокумента()
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);  
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	ДанныеАкта = Новый ТаблицаЗначений;
	ДанныеАкта.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеАкта.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	
	Для сч = 13 По КоличествоСтрок Цикл 	
		Попытка
			Баркод  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 4).ТекущаяОбласть.Текст);
			
			Если Баркод = "" Тогда
				Прервать;
			КонецЕсли;
			
			Количество  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 9).ТекущаяОбласть.Текст);			
		
			НоваяСтрока 			= ДанныеАкта.Добавить();
			НоваяСтрока.Баркод 		= Баркод;
			НоваяСтрока.Количество 	= Количество;
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось загрузить строку " + Строка(сч)); 	
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
	КонецПопытки;
	
	Если ДанныеАкта.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран некорректный файл. Выберите акт приемкм товаров.");
		Возврат;
	КонецЕсли;
	
	НоменклатураКСозданию.Загрузить(ПолучитьСоответствияНоменклатуры(ДанныеАкта));	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Профиль.Партнер) Тогда
		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
			Профиль);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

		Если ЗначениеЗаполнено(Профиль.Договор) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Профиль.Договор, "ХозяйственнаяОперация") = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
				ХозОперация = Профиль.Договор.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда
		Если ЗначениеЗаполнено(Профиль.Соглашение) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Профиль.Соглашение, "ХозяйственнаяОперация") = ХозОперация Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ХозОперация = Профиль.Соглашение.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	Если Комиссия25 Тогда
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПередачаТоваровХранителю"));	
	Иначе	
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.РеализацияТоваровУслуг"));	
	КонецЕсли;
	
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", Профиль.Организация);
	ДанныеЗаполнения.Вставить("Партнер", Профиль.Партнер);
	ДанныеЗаполнения.Вставить("Контрагент", Профиль.Контрагент);
	ДанныеЗаполнения.Вставить("Договор", Профиль.Договор);
	ДанныеЗаполнения.Вставить("Соглашение", Профиль.Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);

	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	
	НовыйДокумент.Партнер 				= Профиль.Партнер;
	НовыйДокумент.Контрагент 			= Профиль.Контрагент;
	НовыйДокумент.Договор 	 			= Профиль.Договор;
	НовыйДокумент.Соглашение 			= Профиль.Соглашение; 
	
	Если Не Комиссия25 Тогда
		НовыйДокумент.ХозяйственнаяОперация = ХозОперация;
	КонецЕсли; 
	
	ТаблицаТранзакций = ПолучитьСписокТоваров();
	
	ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц"); 
	
	Если Не Комиссия25 Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
			НовыйДокумент.Организация, НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
			ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент));
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
			НовыйДокумент.ЦенаВключаетНДС));
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий, Неопределено);
	
	ЗначениеВДанныеФормы(НовыйДокумент, ДанныеФормы);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
&НаСервере
Процедура ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций)
	
	НовыйДокумент.Товары.Очистить();
	НовыйДокумент.ВидыЗапасов.Очистить();  
	
	ВидЦены = Профиль.ВидЦены;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
			ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
			ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.Характеристика;				
			ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
			ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
			ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
			ПараметрыКомплектующих.ЭтоТовар 			= Истина;
			ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
			
			Склады = Новый Массив;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Дата", 		НовыйДокумент.Дата);
			ДополнительныеПараметры.Вставить("Валюта", 		НовыйДокумент.Валюта);
			ДополнительныеПараметры.Вставить("Склады", 		Склады);
			ДополнительныеПараметры.Вставить("Соглашение", 	НовыйДокумент.Соглашение);
			ДополнительныеПараметры.Вставить("Цена", 		Транзакция.Цена);
			ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.Цена);	
			ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены); 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
			Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
			//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
			
			Для Каждого стрКомплекта Из Комплектующие Цикл
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
				НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 		= НоваяСтрока.КоличествоУпаковок;
				НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество + стрКомплекта.Погрешность;
				НоваяСтрока.Склад 					= Склад;
			КонецЦикла;						
		Иначе
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
			НоваяСтрока.Характеристика 			= Транзакция.Характеристика;				
			НоваяСтрока.Количество			 	= Транзакция.Количество;
			НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
			НоваяСтрока.Цена 					= Транзакция.Цена;
			НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество;
			НоваяСтрока.ВидЦены 				= ВидЦены;
			НоваяСтрока.Склад 					= Склад;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
&НаСервере
Функция ПолучитьСписокТоваров()
	
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25") Тогда
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ) КАК ЦеныНоменклатуры25СрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены)";
		
	Иначе
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены)";
	КонецЕсли;	
	
	
	Запрос = Новый Запрос(Текст);
	
	Запрос.УстановитьПараметр("ВидЦены", Профиль.ВидЦены);
	Запрос.УстановитьПараметр("Товары", НоменклатураКСозданию.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

//+ ИнфоСофт Сумин Д.В. 06.05.2024 УА #66084
&НаКлиенте
Процедура СоздатьАктОРасхождении(Команда)
	
	Если Не ЗначениеЗаполнено(ДокументПередачиТоваровНаКомиссиию) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран документ передачи на комиссию.'"),,,"ДокументПередачиТоваровНаКомиссиию");
		Возврат;		
	КонецЕсли;	
	
	Если Избыток.Количество() = 0 И Недостача.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Несоответсвия не найдены.'"));
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
		
	ДанныеЗаполнения.Вставить("ДокументОснование", ДокументПередачиТоваровНаКомиссиию);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	Форма = ПолучитьФорму("Документ.АктОРасхожденияхПослеОтгрузки.ФормаОбъекта", ПараметрыФормы);	
	ДанныеФормы = Форма.Объект; 
	
	ЗаполнитьДокументНаСервере(ДанныеФормы);
	
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	
	Для Каждого ТекущаяСтрока Из Форма.Объект.Товары Цикл   
		
		СтруктураДействий = Новый Структура;
		СамообслуживаниеКлиентСервер.ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Форма.Объект);
		
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		
		Если ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковокПоДокументу Тогда
			
			ТекущаяСтрока.Сумма            = ТекущаяСтрока.СуммаПоДокументу;
			ТекущаяСтрока.СуммаРасхождения = 0;
			
		КонецЕсли; 
		
		РасхожденияКлиентСервер.РассчитатьИтоговыеПоказателиФормы(Форма);
		
	КонецЦикла;
	
	Форма.Открыть();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 06.05.2024 УА #66084

//+ ИнфоСофт Сумин Д.В. 06.05.2024 УА #66084
&НаСервере
Процедура ЗаполнитьДокументНаСервере(ДанныеФормы)
	
	Документ = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.АктОРасхожденияхПослеОтгрузки")); 
			
	//Удалим номенклатуру, которой нет в табличных частях несоответствий, из документа
	ТаблицаНоменклатур = Новый ТаблицаЗначений();
	ТаблицаНоменклатур.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатур.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатур.Колонки.Добавить("КоличествоИзбыток", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	ТаблицаНоменклатур.Колонки.Добавить("КоличествоНедостача", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	
	Для Каждого Строка Из Избыток Цикл
		НоваяСтрока = ТаблицаНоменклатур.Добавить();
		НоваяСтрока.Номенклатура 		= Строка.Номенклатура;
		НоваяСтрока.Характеристика 		= Строка.Характеристика;
		НоваяСтрока.КоличествоИзбыток 	= Строка.Количество;
		НоваяСтрока.КоличествоНедостача = 0;
	КонецЦикла;
	
	Для Каждого Строка Из Недостача Цикл
		НоваяСтрока = ТаблицаНоменклатур.Добавить();
		НоваяСтрока.Номенклатура 		= Строка.Номенклатура;
		НоваяСтрока.Характеристика 		= Строка.Характеристика;
		НоваяСтрока.КоличествоИзбыток 	= 0;
		НоваяСтрока.КоличествоНедостача = Строка.Количество;	
	КонецЦикла;
	
	ТаблицаНоменклатур.Свернуть("Номенклатура,Характеристика", "КоличествоИзбыток,КоличествоНедостача");
	
	МассивУдаляемыСтрок = Новый Массив;
	
	Для Каждого Строка Из Документ.Товары Цикл
		СтрокаНайдена = Ложь; 
		Для Каждого СтрокаНесоответсвий Из ТаблицаНоменклатур Цикл
			Если Строка.Номенклатура = СтрокаНесоответсвий.Номенклатура И Строка.Характеристика = СтрокаНесоответсвий.Характеристика Тогда
				СтрокаНайдена = Истина;	
			КонецЕсли;	
		КонецЦикла;
		
		Если Не СтрокаНайдена Тогда
			МассивУдаляемыСтрок.Добавить(Строка);		
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыСтрок Цикл
		Документ.Товары.Удалить(Элемент);	
	КонецЦикла;	
	
	//Заполнение документа
	Для Каждого СтрокаТовары Из Документ.Товары Цикл
		Для Каждого Строка Из ТаблицаНоменклатур Цикл
			Если Строка.Номенклатура = СтрокаНесоответсвий.Номенклатура И Строка.Характеристика = СтрокаНесоответсвий.Характеристика Тогда
				СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок + (Строка.КоличествоИзбыток - Строка.КоличествоНедостача);
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;  
			
	ЗначениеВДанныеФормы(Документ, ДанныеФормы);			
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 06.05.2024 УА #66084
	
#КонецОбласти
